In [14]:
import pandas as pd
import matplotlib.pyplot as plt

Pandas is an open-source data manipulation and analysis library for Python. It provides data structures for efficiently handling large datasets and tools for working with structured data. Here's an overview of key aspects of the Pandas library:

1. Data Structures:

Series: A one-dimensional array capable of holding any data type. It's similar to a column in a spreadsheet or a single variable in statistics.

DataFrame: A two-dimensional table with rows and columns. It can be thought of as a spreadsheet or SQL table, where each column can be a different data type.

2. Data Loading and Saving:

Pandas provides functions to read data from various file formats such as CSV, Excel, SQL databases, JSON, and more.

It also allows you to write data back to these formats.

3. Data Cleaning and Preparation:

Pandas offers powerful tools for cleaning and preparing data, including handling missing values, filtering, sorting, and merging datasets.

Methods like dropna(), fillna(), and duplicated() are commonly used for data cleaning.

4. Indexing and Selecting Data:

Pandas uses labels for indexing and selecting data. The loc and iloc attributes are commonly used for label-based and integer-based indexing, respectively.

Conditional indexing is a powerful feature for selecting specific subsets of data.

5. Operations and Transformations:

Pandas supports element-wise operations between series and dataframes, similar to NumPy.

It provides various statistical and mathematical operations, along with methods like groupby for aggregating data.

6. Visualization:

While Pandas itself is not a visualization library, it integrates well with Matplotlib and Seaborn for creating visualizations.

DataFrames have built-in plotting methods for quick exploratory data visualization.

7. Integration with Other Libraries:

Pandas is often used in conjunction with other libraries like NumPy, Matplotlib, and Scikit-Learn to form a powerful data analysis and machine learning toolkit.

8. Use Cases:

Pandas is widely used for data cleaning, exploration, and analysis in fields such as finance, economics, social sciences, and more.

It is a foundational tool for data scientists, analysts, and researchers working with structured data.

Pandas is a versatile library that plays a crucial role in the Python ecosystem for data analysis. Its flexibility and ease of use make it a popular choice for handling and analyzing tabular data.

Series:

A Series is a one-dimensional array-like object in Pandas.

It is similar to a column in a spreadsheet or a single variable in statistics.

Each element in a Series has an associated index, which can be explicitly set or is automatically generated.

You can create a Series from a Python list, NumPy array, or dictionary.

### 1. Series 
A Pandas  Series  is a one-dimensional array of indexed data. 
#### Syntax : pd.Series(data, index=index)

In [15]:
import pandas as pd
import numpy as np

# Creating a Series from a list
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)
#In this example, the index is automatically generated, and the data consists of integers and a NaN (representing a missing value).

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [16]:
s.describe()

count    5.000000
mean     4.600000
std      2.701851
min      1.000000
25%      3.000000
50%      5.000000
75%      6.000000
max      8.000000
dtype: float64

In [17]:
s.info()

<class 'pandas.core.series.Series'>
RangeIndex: 6 entries, 0 to 5
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      float64
dtypes: float64(1)
memory usage: 180.0 bytes

DataFrame:

A DataFrame is a two-dimensional table with rows and columns, similar to a spreadsheet or a SQL table.

It is the primary data structure in Pandas and is used for most data manipulation and analysis tasks.

Each column in a DataFrame is a Series.

DataFrame allows you to handle heterogeneous data types and supports a wide range of operations.

### 2. Dataframes

An effective object/data structure offered by PANDAS that allows us to handle the tabular form of data(which is basically what we get to work with on a day to day basis)

#### Syntax : pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)

In [18]:
# Creating a DataFrame from a dictionary
# Sample data for the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 28, 24],
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin'],
    'Salary': [60000, 75000, 80000, 62000, 57000],
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05'],
    'Category': ['A', 'B', 'C', 'A', 'B']
}
df = pd.DataFrame(data)
df.to_csv('data.csv')
# df.to_excel('data.xlsx', index=False, sheet_name='Sheet1')
# df.to_json('data.json', orient='records')
# engine = create_engine('sqlite:///data.db')   >df.to_sql('my_table', engine, index=False, if_exists='replace')
df

      Name  Age      City  Salary        Date Category
0    Alice   25  New York   60000  2023-01-01        A
1      Bob   30    London   75000  2023-01-02        B
2  Charlie   35     Tokyo   80000  2023-01-03        C
3    David   28     Paris   62000  2023-01-04        A
4      Eva   24    Berlin   57000  2023-01-05        B

In [87]:
# Reading data from a CSV file
df = pd.read_csv(r"D:\Python\7.Pandas\data.csv")
#pd.read_excel()
# pd.read_json('data.json')
# sqlite3.connect('database.db')

# Exploring Data

In [21]:
# Display the first few rows
#df.head(2)
# Display the last few rows
df.tail(2)

   Unnamed: 0   Name  Age    City  Salary        Date Category
3           3  David   28   Paris   62000  2023-01-04        A
4           4    Eva   24  Berlin   57000  2023-01-05        B

In [71]:
df.shape

(5, 8)

In [72]:
df.columns

Index(['Unnamed: 0', 'Name', 'Age', 'City', 'Salary', 'Date', 'cate', 'Rank'], dtype='object')

In [73]:
df.dtypes

Unnamed: 0      int64
Name           object
Age           float64
City           object
Salary          int64
Date           object
cate           object
Rank          float64
dtype: object

In [23]:
# Information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      int64
 1   Name        5 non-null      object
 2   Age         5 non-null      int64
 3   City        5 non-null      object
 4   Salary      5 non-null      int64
 5   Date        5 non-null      object
 6   Category    5 non-null      object
dtypes: int64(3), object(4)
memory usage: 412.0+ bytes

In [22]:
# Basic summary statistics
df.describe()

       Unnamed: 0        Age        Salary
count    5.000000   5.000000      5.000000
mean     2.000000  28.400000  66800.000000
std      1.581139   4.393177  10084.641788
min      0.000000  24.000000  57000.000000
25%      1.000000  25.000000  60000.000000
50%      2.000000  28.000000  62000.000000
75%      3.000000  30.000000  75000.000000
max      4.000000  35.000000  80000.000000

In [24]:
# Accessing specific columns
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [25]:
# Accessing specific columns
df[['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4      Eva   24

# Data Cleaning and Preprocessing:

In [91]:
data = pd.DataFrame({'A': [1, 2, None, 4, None, 6, 7], 'B': [7, None, 9, None, 11, None,7]})
data

     A     B
0  1.0   7.0
1  2.0   NaN
2  NaN   9.0
3  4.0   NaN
4  NaN  11.0
5  6.0   NaN
6  7.0   7.0

In [92]:
data.isnull().sum()

A    2
B    3
dtype: int64

In [90]:
data.isna().sum()

A    2
B    3
dtype: int64

In [93]:
df.duplicated().sum()

0

In [30]:
data.dropna()
#data.dropna(subset=['B])

     A    B
0  1.0  7.0

In [31]:
data['A'].fillna(0, inplace=True)
data

C:\Users\Admin\AppData\Local\Temp\ipykernel_7320\1281185365.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['A'].fillna(0, inplace=True)

     A     B
0  1.0   7.0
1  2.0   NaN
2  0.0   9.0
3  4.0   NaN
4  0.0  11.0
5  6.0   NaN

In [32]:
data = pd.Series([1, 2, None, 4, None, 6])
data.interpolate(inplace=True)
print(data)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [33]:
data = pd.Series([1, None, None, 4, None, 6,None])
data.fillna(method='ffill', inplace=True)
data.drop_duplicates()

C:\Users\Admin\AppData\Local\Temp\ipykernel_7320\2268179763.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill', inplace=True)

0    1.0
3    4.0
5    6.0
dtype: float64

**For Dateset** 

**Finding Missing Values**

In [74]:
df.isnull().sum()

Unnamed: 0    0
Name          0
Age           0
City          0
Salary        0
Date          0
cate          0
Rank          0
dtype: int64

In [75]:
df.isna().sum()

Unnamed: 0    0
Name          0
Age           0
City          0
Salary        0
Date          0
cate          0
Rank          0
dtype: int64

In [76]:
df.duplicated().sum()

0

**Handling Missing Values**

In [80]:
# Handling missing values
df.dropna()  # Drop rows with any missing values

   Unnamed: 0     Name   Age      City  Salary        Date cate  Rank
0           0    Alice  25.0  New York   60000  2023-01-01    A   2.0
1           1      Bob  30.0    London   75000  2023-01-02    B   4.0
2           2  Charlie  35.0     Tokyo   80000  2023-01-03    C   5.0
3           3    David  28.0     Paris   62000  2023-01-04    A   3.0
4           4   Rohith  24.0    Berlin   57000  2023-01-05    B   1.0

In [35]:
# Removing duplicates
df.drop_duplicates()

   Unnamed: 0     Name  Age      City  Salary        Date Category
0           0    Alice   25  New York   60000  2023-01-01        A
1           1      Bob   30    London   75000  2023-01-02        B
2           2  Charlie   35     Tokyo   80000  2023-01-03        C
3           3    David   28     Paris   62000  2023-01-04        A
4           4      Eva   24    Berlin   57000  2023-01-05        B

In [95]:
df = df.drop(['Unnamed: 0'], axis=1)

**Special Function**

In [96]:
df[df['City'].str.contains('N')]

    Name  Age      City  Salary        Date Category
0  Alice   25  New York   60000  2023-01-01        A

In [84]:
df['City'].str.split(' ')

0    [New, York]
1       [London]
2        [Tokyo]
3        [Paris]
4       [Berlin]
Name: City, dtype: object

In [85]:
df['City'].str.split(' ').str.get(0)

0       New
1    London
2     Tokyo
3     Paris
4    Berlin
Name: City, dtype: object

In [36]:
# Convert text to lowercase
df['Name1'] = df['Name'].str.lower()

In [37]:
# Converting data types
df['Age'] = df['Age'].astype('float')
df = df.drop('Name1',axis=1)
df

   Unnamed: 0     Name   Age      City  Salary        Date Category
0           0    Alice  25.0  New York   60000  2023-01-01        A
1           1      Bob  30.0    London   75000  2023-01-02        B
2           2  Charlie  35.0     Tokyo   80000  2023-01-03        C
3           3    David  28.0     Paris   62000  2023-01-04        A
4           4      Eva  24.0    Berlin   57000  2023-01-05        B

In [112]:
df.rename(columns={'Category': 'Cate'}, inplace=True)
df

      Name  Age      City  Salary        Date Cate  Rank
0    Alice   25  New York   60000  2023-01-01    A   2.0
1      Bob   30    London   75000  2023-01-02    B   4.0
2  Charlie   35     Tokyo   80000  2023-01-03    C   5.0
3    David   28     Paris   62000  2023-01-04    A   3.0
4      Eva   24    Berlin   57000  2023-01-05    B   1.0

### **Data Selection and Indexing:**

In [118]:
# Select specific columns
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5     Roshan
6     sameer
Name: Name, dtype: object

In [41]:
# Select specific columns
df[['Name', 'City']]

      Name      City
0    Alice  New York
1      Bob    London
2  Charlie     Tokyo
3    David     Paris
4      Eva    Berlin

In [42]:
df[2:3]

   Unnamed: 0     Name   Age   City  Salary        Date cate
2           2  Charlie  35.0  Tokyo   80000  2023-01-03    C

In [43]:
df[-3:-1:1]

   Unnamed: 0     Name   Age   City  Salary        Date cate
2           2  Charlie  35.0  Tokyo   80000  2023-01-03    C
3           3    David  28.0  Paris   62000  2023-01-04    A

In [97]:
# Select rows based on a condition
df[df['Age'] >= 30]

      Name  Age    City  Salary        Date Category
1      Bob   30  London   75000  2023-01-02        B
2  Charlie   35   Tokyo   80000  2023-01-03        C

In [119]:
# Assuming 'df' is your DataFrame
df_filtered = df[df['Age'] > 30]
df_filtered

      Name Age   City  Salary        Date Cate  Rank
2  Charlie  35  Tokyo   80000  2023-01-03    C   5.0

In [120]:
df_filtered = df[(df['Age'] > 20) & (df['Name'] == 'David')]
df_filtered

    Name Age   City  Salary        Date Cate  Rank
3  David  28  Paris   62000  2023-01-04    A   3.0

In [121]:
df_filtered = df[df['City'].isin(['New York', 'San Francisco'])]
df_filtered

    Name Age      City  Salary        Date Cate  Rank
0  Alice  25  New York   60000  2023-01-01    A   2.0

In [122]:
df_filtered = df.query('Age > 30')
df_filtered

      Name Age   City  Salary        Date Cate  Rank
2  Charlie  35  Tokyo   80000  2023-01-03    C   5.0

## **Data Exploration:**

In [99]:
print(df['Age'].mean())
print(df['Salary'].std())
print(df['Salary'].median())
print(df['Age'].min())
print(df['Age'].max())
print(df['Salary'].sum())
df['Salary'].var()

28.4
10084.641788382967
62000.0
24
35
334000

101700000.0

In [86]:
df['City'].value_counts()

City
New York    1
London      1
Tokyo       1
Paris       1
Berlin      1
Name: count, dtype: int64

### **Data Aggregation:**

In [45]:
# Group by a column and calculate the mean for each group
df.groupby('City')['Age'].mean()

City
Berlin      24.0
London      30.0
New York    25.0
Paris       28.0
Tokyo       35.0
Name: Age, dtype: float64

In [113]:
# Calculate multiple aggregations simultaneously
df.groupby('City').agg({'Age': 'mean', 'Salary': 'sum'})

           Age  Salary
City
Berlin    24.0   57000
London    30.0   75000
New York  25.0   60000
Paris     28.0   62000
Tokyo     35.0   80000

In [47]:
print("befor",df['Name'][4])
df['Name'][4] = 'Rohith'
print("after",df['Name'][4])

befor Eva
after Rohith

C:\Users\Admin\AppData\Local\Temp\ipykernel_7320\2971680182.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Name'][4] = 'Rohith'
C:\Users\Admin\AppData\Local\Temp\ipykernel_7320\2971680182.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][4] = 'Rohith'

In [110]:
# Sorting data
df.sort_values(by='Age', ascending=False)

      Name  Age      City  Salary        Date Category  Rank
2  Charlie   35     Tokyo   80000  2023-01-03        C   5.0
1      Bob   30    London   75000  2023-01-02        B   4.0
3    David   28     Paris   62000  2023-01-04        A   3.0
0    Alice   25  New York   60000  2023-01-01        A   2.0
4      Eva   24    Berlin   57000  2023-01-05        B   1.0

In [109]:
# Assign ranks based on Age
df['Rank'] = df['Age'].rank(ascending=True, method='average')
df

      Name  Age      City  Salary        Date Category  Rank
0    Alice   25  New York   60000  2023-01-01        A   2.0
1      Bob   30    London   75000  2023-01-02        B   4.0
2  Charlie   35     Tokyo   80000  2023-01-03        C   5.0
3    David   28     Paris   62000  2023-01-04        A   3.0
4      Eva   24    Berlin   57000  2023-01-05        B   1.0

### **Data Manipulation:**

In [101]:
print(df.loc[1])

Name               Bob
Age                 30
City            London
Salary           75000
Date        2023-01-02
Category             B
Name: 1, dtype: object

In [102]:
print(df.iloc[1])

Name               Bob
Age                 30
City            London
Salary           75000
Date        2023-01-02
Category             B
Name: 1, dtype: object

In [103]:
print(df.loc[2:3])

      Name  Age   City  Salary        Date Category
2  Charlie   35  Tokyo   80000  2023-01-03        C
3    David   28  Paris   62000  2023-01-04        A

In [106]:
print(df.iloc[1:4])

      Name  Age    City  Salary        Date Category
1      Bob   30  London   75000  2023-01-02        B
2  Charlie   35   Tokyo   80000  2023-01-03        C
3    David   28   Paris   62000  2023-01-04        A

In [107]:
print(df.loc[0, "City"])

New York

In [108]:
print(df.iloc[1, 1])

30

#### **Adding New Row**

In [117]:
df

      Name   Age      City  Salary        Date Cate  Rank
0    Alice    25  New York   60000  2023-01-01    A   2.0
1      Bob    30    London   75000  2023-01-02    B   4.0
2  Charlie    35     Tokyo   80000  2023-01-03    C   5.0
3    David    28     Paris   62000  2023-01-04    A   3.0
4      Eva    24    Berlin   57000  2023-01-05    B   1.0
5   Roshan    25     Blore   20000  2023-01-06    b   1.0
6   sameer  None     Paris   20000  2023-01-06    A   5.0

In [114]:
df.loc[5] = {'Name':'Roshan',"Age":25,'City':'Blore','Salary':20000,'Date':'2023-01-06','Cate':"b", 'Rank':1.0}

In [116]:
df.loc[6] = ['sameer', None, 'Paris',20000, '2023-01-06','A', 5.0]

In [51]:
# Droping Row
#df = df.drop(7)

### **Apply**

In [59]:
# Sample data
data = [1, 2, 3, 4, 5]
series = pd.Series(data)

# Define a function to double the value of each element
def double(x):
    return x * 2

# Apply the function to the Series
result = series.apply(double)
print(result)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [60]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df3 = pd.DataFrame(data)
print(df3)
# Define a function to double the value of each element
def double(x):
    return x * 2

# Apply the function to the DataFrame, column-wise (default behavior)
result = df3.apply(double)
result1= df3.applymap(double)
print(result1)
print(result)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
   A   B   C
0  2   8  14
1  4  10  16
2  6  12  18
   A   B   C
0  2   8  14
1  4  10  16
2  6  12  18

C:\Users\Admin\AppData\Local\Temp\ipykernel_7320\459620773.py:10: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  result1= df3.applymap(double)

In [61]:
left_data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 28, 24],
}

left_df = pd.DataFrame(left_data)

# Sample data for right DataFrame
right_data = {
    'ID': [1, 2, 4, 5, 6],
    'City': ['New York', 'London', 'Paris', 'Berlin', 'Tokyo'],
    'Salary': [60000, 75000, 62000, 57000, 80000],
}

right_df = pd.DataFrame(right_data)

In [62]:
# Data Merging and Joining:
# Merging DataFrames based on a common column
merged_df = pd.merge(left_df, right_df, on='ID')
merged_df

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000

In [63]:
# Joining DataFrames based on the index
# Inner join on 'ID' column
result_inner = pd.merge(left_df, right_df, on='ID', how='inner')
print(result_inner)

# Left join on 'ID' column
result_left = pd.merge(left_df, right_df, on='ID', how='left')
print(result_left)

# Right join on 'ID' column
result_right = pd.merge(left_df, right_df, on='ID', how='right')
print(result_right)

# Outer join on 'ID' column
result_outer = pd.merge(left_df, right_df, on='ID', how='outer')
print(result_outer)

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000
   ID     Name  Age      City   Salary
0   1    Alice   25  New York  60000.0
1   2      Bob   30    London  75000.0
2   3  Charlie   35       NaN      NaN
3   4    David   28     Paris  62000.0
4   5      Eva   24    Berlin  57000.0
   ID   Name   Age      City  Salary
0   1  Alice  25.0  New York   60000
1   2    Bob  30.0    London   75000
2   4  David  28.0     Paris   62000
3   5    Eva  24.0    Berlin   57000
4   6    NaN   NaN     Tokyo   80000
   ID     Name   Age      City   Salary
0   1    Alice  25.0  New York  60000.0
1   2      Bob  30.0    London  75000.0
2   3  Charlie  35.0       NaN      NaN
3   4    David  28.0     Paris  62000.0
4   5      Eva  24.0    Berlin  57000.0
5   6      NaN   NaN     Tokyo  80000.0

# Time Series Analysis:

In [64]:
date = pd.to_datetime(df["Date"])
print(date)

date_range = pd.date_range(start='2023-08-01', periods=5, freq='D')
print(date_range)

0   2023-01-01
1   2023-01-02
2   2023-01-03
3   2023-01-04
4   2023-01-05
Name: Date, dtype: datetime64[ns]
DatetimeIndex(['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04',
               '2023-08-05'],
              dtype='datetime64[ns]', freq='D')

In [65]:
# Creating a DataFrame with dates as the index
data = {'value': [10, 20, 15, 25]}
index_dates = pd.date_range(start='2023-08-01', periods=4, freq='D')
df1 = pd.DataFrame(data, index=index_dates)
print(df1)
print(df1.loc['2023-08-02'])

            value
2023-08-01     10
2023-08-02     20
2023-08-03     15
2023-08-04     25
value    20
Name: 2023-08-02 00:00:00, dtype: int64

In [66]:

# Creating a DataFrame with hourly data
data = {'value': [10, 20, 15, 25, 30, 35]}
index_dates = pd.date_range(start='2023-08-01', periods=6, freq='H')
df2 = pd.DataFrame(data, index=index_dates)
print(df2)
# Resample to daily frequency and calculate the mean for each day
daily_mean = df2.resample('D').mean()
print(daily_mean)

                     value
2023-08-01 00:00:00     10
2023-08-01 01:00:00     20
2023-08-01 02:00:00     15
2023-08-01 03:00:00     25
2023-08-01 04:00:00     30
2023-08-01 05:00:00     35
            value
2023-08-01   22.5

C:\Users\Admin\AppData\Local\Temp\ipykernel_7320\2304677722.py:3: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  index_dates = pd.date_range(start='2023-08-01', periods=6, freq='H')

In [68]:
df

   Unnamed: 0     Name   Age      City  Salary        Date cate  Rank
0           0    Alice  25.0  New York   60000  2023-01-01    A   2.0
1           1      Bob  30.0    London   75000  2023-01-02    B   4.0
2           2  Charlie  35.0     Tokyo   80000  2023-01-03    C   5.0
3           3    David  28.0     Paris   62000  2023-01-04    A   3.0
4           4   Rohith  24.0    Berlin   57000  2023-01-05    B   1.0

### **Pivote Table**

In [70]:
df.pivot_table(index='Date', columns='cate', values='Salary', aggfunc='sum')

cate              A        B        C
Date
2023-01-01  60000.0      NaN      NaN
2023-01-02      NaN  75000.0      NaN
2023-01-03      NaN      NaN  80000.0
2023-01-04  62000.0      NaN      NaN
2023-01-05      NaN  57000.0      NaN

In [ ]:
# Shifting the index one day forward
df_shifted = df.shift(2)
df_shifted

   Unnamed: 0     Name   Age      City   Salary        Date  cate  Rank
0         NaN     None   NaN      None      NaN        None  None   NaN
1         NaN     None   NaN      None      NaN        None  None   NaN
2         0.0    Alice  25.0  New York  60000.0  2023-01-01     A   2.0
3         1.0      Bob  30.0    London  75000.0  2023-01-02     B   4.0
4         2.0  Charlie  35.0     Tokyo  80000.0  2023-01-03     C   5.0

In [ ]:
# Ordinal Encoding
data = pd.DataFrame({'Grade': ['A', 'B', 'C', 'A', 'D']})

grade_mapping = {'A': 3, 'B': 2, 'C': 1, 'D': 0}
data['Grade_OrdinalEncoded'] = data['Grade'].map(grade_mapping)
print(data)

  Grade  Grade_OrdinalEncoded
0     A                     3
1     B                     2
2     C                     1
3     A                     3
4     D                     0

In [ ]:
df5 = df[1:].reset_index(drop=True)
df5

   Unnamed: 0     Name   Age    City  Salary        Date cate  Rank
0           1      Bob  30.0  London   75000  2023-01-02    B   4.0
1           2  Charlie  35.0   Tokyo   80000  2023-01-03    C   5.0
2           3    David  28.0   Paris   62000  2023-01-04    A   3.0
3           4   Rohith  24.0  Berlin   57000  2023-01-05    B   1.0

### **Assignment**

In [ ]:
# Sample dataset: Employee records
data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Michael', 'Sarah', 'David'],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'Sales'],
    'Salary': [60000, 70000, 80000, 75000, 65000],
    'Age': [35, 28, 42, 30, 38]
}

1. What is the function to create a DataFrame in pandas?
2. How can you display the first 5 rows of a DataFrame?
3. How do you check the dimensions of a DataFrame?
4. What method is used to check for missing values in a DataFrame?
5. How do you select a single column from a DataFrame?
7. How do you rename a specific column in a DataFrame?
8. What method is used to drop rows with missing values in a DataFrame?
9. How can you filter rows in a DataFrame based on a condition?
10. What function can be used to apply a function to each element of a DataFrame column?
11. How do you sort a DataFrame by values in a specific column?
12. What method can you use to create a new column based on existing columns in a DataFrame?
13. How can you save a DataFrame to a CSV file?
14. How do you calculate the mean salary of employees in the DataFrame?
15. How can you find the oldest employee in the DataFrame?
16. How do you count the number of employees in each department?
17. How can you find the employee with the highest salary?
18. What is the median age of employees?
19. What is the maximum salary in the Sales department?
20. How do you reset the index of the DataFrame?

In [ ]:
#What is the function to create a DataFrame in pandas?
df = pd.DataFrame(data)

In [ ]:
#How can you display the first 5 rows of a DataFrame?
df.head()

In [ ]:
#How do you check the dimensions of a DataFrame?
df.shape

In [ ]:
#What method is used to check for missing values in a DataFrame?
df.isnull().sum()

In [ ]:
#How do you select a single column from a DataFrame?
df['Name']

In [ ]:
# How do you rename a specific column in a DataFrame?
df.rename(columns={'Salary': 'Annual_Salary'}, inplace=True)

In [ ]:
#What method is used to drop rows with missing values in a DataFrame?
df.dropna()

In [ ]:
#How can you filter rows in a DataFrame based on a condition?
df[df['Annual_Salary'] > 70000]

In [ ]:
#What function can be used to apply a function to each element of a DataFrame column?
df['Annual_Salary'] = df['Annual_Salary'].apply(lambda x: x * 2)

In [ ]:
#How do you sort a DataFrame by values in a specific column?
df.sort_values(by='Age')

In [ ]:
# What method can you use to create a new column based on existing columns in a DataFrame?
df['Salary_Rank'] = df['Annual_Salary'].rank(ascending=False).astype(int)

In [ ]:
# How can you save a DataFrame to a CSV file?
df.to_csv('employee_records.csv', index=False)

In [ ]:
# How do you calculate the mean salary of employees in the DataFrame?
df['Salary'].mean()

In [ ]:
# How can you find the oldest employee in the DataFrame?
df[df['Age'] == df['Age'].max()]

In [ ]:
#How do you count the number of employees in each department?
df['Department'].value_counts()

In [ ]:
#How can you find the employee with the highest salary?
df[df['Salary'] == df['Salary'].max()]

In [ ]:
#What is the median age of employees?
df['Age'].median()

In [ ]:
#What is the maximum salary in the Sales department?
df[df['Department'] == 'Sales']['Salary'].max()

In [ ]:
#How do you reset the index of the DataFrame?
df.reset_index(drop=True, inplace=True)